БИТУправление_медицинским_центром_демо/src/Documents/КомплексныйРасчетКлиента/КомплексныйРасчетКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КомплексныйРасчетКлиента</name>
  <registerRecords>AccumulationRegister.НоменклатураКомплексныхРасчетовКлиентов</registerRecords>
  <registerRecords>AccumulationRegister.ВыработкаСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровНаСкладах</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыКомплексныхРасчетовКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Прейскурант</name>
    <type>
      <types>CatalogRef.Прейскуранты</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Остановлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимыйДолг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Прием</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентАванса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИгнорироватьДолг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСоСкидкой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИгнорироватьДолг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сырье</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Спецификация</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>CatalogRef.ПараметрыСпецификаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДобавленАвтоматически</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиСортировки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыРабот</name>
    <attributes>
      <name>ИдентификаторЭтапа</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторСтрокой</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсполнительПлан</name>
      <type>
        <types>DefinedType.ИсполнителиЭтаповКомплексногоРасчета</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/СостоянияЗаказовНаИзготовление/СостоянияЗаказовНаИзготовление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияЗаказовНаИзготовление</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.ВидыСостоянийЗаказов</types>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DefinedType.КомплексныйРасчетКлиента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DefinedType.ДокументыСменыСтатусовЗаказовНаПроизводство</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/ПланыЛечения/ПланыЛечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПланыЛечения</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>удалитьДокументРегистратор</name>
    <type>
      <types>DocumentRef.Прием</types>
    </type>
  </resources>
  <resources>
    <name>ПриемовВДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дозировка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ПервичныйПрием</name>
    <comment>Документ, созданный первым в рамках одного обращения пациента</comment>
    <type>
      <types>DefinedType.ПервичныйПрием</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЭлемента</name>
    <comment>Собственный идентификатор элемента плана лечения</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЭлемента</name>
    <type>
      <types>EnumRef.ВидыНазначений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.СправочникМеждународныхНепатентованныхНаименований</types>
      <types>CatalogRef.Номенклатура</types>
      <types>String</types>
      <types>CatalogRef.КатегорииВыработки</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПорядокЭлемента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРегистратор</name>
    <type>
      <types>DocumentRef.Прием</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/AccumulationRegisters/НоменклатураКомплексныхРасчетовКлиентов/НоменклатураКомплексныхРасчетовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НоменклатураКомплексныхРасчетовКлиентов</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КомплексныйРасчет</name>
    <type>
      <types>DefinedType.КомплексныйРасчетКлиента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючСтроки</name>
    <type>
      <types>CatalogRef.КлючиСтрокКомплексныхРасчетов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БИТУправление_медицинским_центром_демо/src/Enums/ВидыНоменклатуры/ВидыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНоменклатуры</name>
  <comment>Виды номенклатуры</comment>
  <enumValues>
    <name>Материал</name>
    <comment>Основной вид ТМЦ, учитываемый на складах</comment>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
    <comment>Услуга, не хранится на складах</comment>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Enums/ТипыКомплексныхРасчетовКлиентов/ТипыКомплексныхРасчетовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКомплексныхРасчетовКлиентов</name>
  <enumValues>
    <name>КомплекснаяПрограмма</name>
  </enumValues>
  <enumValues>
    <name>ПредварительныйРасчет</name>
  </enumValues>
  <enumValues>
    <name>ПроизводственныйРасчет</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Catalogs/КлючиСтрокКомплексныхРасчетов/КлючиСтрокКомплексныхРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлючиСтрокКомплексныхРасчетов</name>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИгнорироватьДолг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Documents/КомплексныйРасчетКлиента/ObjectModule.bsl
#Область РазделОписанияПеременных
Перем мУчетнаяПолитика; 
#КонецОбласти

#Область ПрограммныйИнтерфейс
// Расчитывает сумму к оплате по документу
//
// Возвращаемое значение:
//  Число - Сумма
//
Функция РассчитатьСуммуВсего() Экспорт
	
	Возврат Состав.Итог("Сумма");
	                                                                                     
КонецФункции
#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

#Область СлужебныеПроцедурыИФункции

Процедура ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаСостава) 

	// Получим необходимые данные для проведения и проверки заполенения данных по табличной части "Товары".
	СтруктураПолей = Новый Структура();
	СтруктураПолей.Вставить("Номенклатура"        , "Номенклатура");
	СтруктураПолей.Вставить("ХарактеристикаНоменклатуры" , "ХарактеристикаНоменклатуры");
	СтруктураПолей.Вставить("ВидНоменклатуры"     , "Номенклатура.ВидНоменклатуры");
	СтруктураПолей.Вставить("ЕдиницаИзмерения"    , "ЕдиницаИзмерения");
	СтруктураПолей.Вставить("Количество"          , "Количество * ВЫБОР КОГДА Номенклатура.ВидНоменклатуры = Значение(Перечисление.ВидыНоменклатуры.Материал) 
													|ТОГДА Коэффициент/Номенклатура.ЕдиницаХраненияОстатков.Коэффициент 
												    |ИНАЧЕ 1 КОНЕЦ");
	СтруктураПолей.Вставить("Цена"                , "ЦенаСоСкидкой");
	СтруктураПолей.Вставить("Сумма"               , "Сумма");
	
	РезультатЗапросаПоРаботам = ПроведениеДокументов.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Состав", СтруктураПолей);
	ТаблицаПоТоварам = РезультатЗапросаПоРаботам.Выгрузить();
	
	ТаблицаСостава = СформироватьТаблицуСтрокДокумента();
	ТаблицаСостава.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, Цена, ЕдиницаИзмерения, ИгнорироватьДолг", "Количество, Сумма");	
	
КонецПроцедуры // ПодготовитьТаблицыДокумента()

// Проверяет правильность заполнения строк табличной части.
//
// Параметры: 
//  ТаблицаПоТоварам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок, ИмяТабличнойЧасти = "Товары")
                                                           
	// Укажем, что надо проверить
	СтруктураОбязательныхПолей = Новый Структура("Номенклатура, Количество, ЕдиницаИзмерения");
	Если не мУчетнаяПолитика.РазрешитьПродажуПоНулевойСтоимости Тогда
		СтруктураОбязательныхПолей.Вставить("Сумма");
	КонецЕсли;
	
	МетаданныеРеквизиты = Метаданные().ТабличныеЧасти.Состав.Реквизиты;

	// Цикл по строкам табличной части.
	Для каждого СтрокаТаблицы Из ТаблицаПоТоварам Цикл
		СтрокаНачалаСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В строке номер ""%1"" табличной части: '"),СокрЛП(СтрокаТаблицы.НомерСтроки));
		// Цикл по проверяемым полям
		Для каждого КлючЗначение Из СтруктураОбязательныхПолей Цикл
			Если КлючЗначение.Ключ = "ЕдиницаИзмерения" И СтрокаТаблицы.Номенклатура.ВидНоменклатуры <> Перечисления.ВидыНоменклатуры.Материал Тогда
				Продолжить;
			КонецЕсли;
			
			Значение = СтрокаТаблицы[КлючЗначение.Ключ];
			Если не ЗначениеЗаполнено(Значение) Тогда // Надо ругаться
				Если не ЗначениеЗаполнено(КлючЗначение.Значение) Тогда // Стандартное ругательство
					ПредставлениеРеквизита = МетаданныеРеквизиты[КлючЗначение.Ключ].Представление();
					СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Не заполнено значение реквизита ""%1""!'"),СокрЛП(ПредставлениеРеквизита));
				Иначе
					СтрокаСообщения = КлючЗначение.Значение;
				КонецЕсли;
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;	
	
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиТовары()

Процедура ПроверкаОбразованияОтрицательныхОстатков(Отказ)
	
	// Проверка, что после изменения проведенного документа не образовались отрицательные остатки.
	ТаблицаНехватки = Документы.КомплексныйРасчетКлиента.ПроверитьОбразованиеОтрицательныхОстатковПоИзмененномуРасчету(Ссылка, Отказ);
	Если ТаблицаНехватки.Количество() <> 0 Тогда
		
		ТекстСообщения = НСтр("ru='Изменение документа влечет образование отрицательных остатков по его услугам!'"); 
		Для Каждого СтрокаТаблицы Из ТаблицаНехватки Цикл
			ТекстПерерасход = НСтр("ru='перерасход'");
			ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(ТекстСообщения,
				КомплексныеРасчетыКлиентовКлиентСервер.СформироватьПредставлениеСтрокиКомплексногоРасчета(СтрокаТаблицы) + 
				" - " + ТекстПерерасход + ": " + (-СтрокаТаблицы.Количество), Символы.ПС);
		КонецЦикла;
			
		ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеПередПроведением(Отказ, ТаблицаСостава)
	
	// Проверим, что нет 2 одинаковых строк с разной игнорируемостью долга.
	КопияТаблицаСостава = ТаблицаСостава.Скопировать();
	
	СтруктураКлюча = Справочники.КлючиСтрокКомплексныхРасчетов.ПолучитьСтруктуруИзмеренийКлючаСтроки();
	СтрокаСверткиКлюча = "";
	Для Каждого КлючЗначение Из СтруктураКлюча Цикл
		ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(СтрокаСверткиКлюча, КлючЗначение.Ключ, ",");
	КонецЦикла;
	
	КопияТаблицаСостава.Свернуть(СтрокаСверткиКлюча);
	КопияТаблицаСостава.Колонки.Добавить("КоличествоСтрок");
	КопияТаблицаСостава.ЗаполнитьЗначения(1, "КоличествоСтрок");
	
	СтрокаСверткиКлюча = СтрЗаменить(СтрокаСверткиКлюча, "ИгнорироватьДолг", "");
	СтрокаСверткиКлюча = СтрЗаменить(СтрокаСверткиКлюча, ",,", "");
	
	КопияТаблицаСостава.Свернуть(СтрокаСверткиКлюча, "КоличествоСтрок");
	
	СтрокиОшибок = КопияТаблицаСостава.НайтиСтроки(Новый Структура("КоличествоСтрок", 2));
	
	Если СтрокиОшибок.Количество() <> 0 Тогда
		СообщениеОбОшибке = НСтр("ru='Ошибка при проведении документа:
							|не допускается наличие одинаковых строк с разным значением признака ""Игнорировать долг""!'");
		ОбщегоНазначения.СообщитьОбОшибке(СообщениеОбОшибке, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьТаблицуСтрокДокумента()
	
	ТаблицаСостава = Состав.Выгрузить(,"Номенклатура, ХарактеристикаНоменклатуры, ЦенаСоСкидкой, ЕдиницаИзмерения, ИгнорироватьДолг, Примечание, Количество, Сумма");
	ТаблицаСостава.Колонки.ЦенаСоСкидкой.Имя = "Цена";
	
	Возврат ТаблицаСостава;
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Был ли проведен документ перед изменением
	ДополнительныеСвойства.Вставить("СсылкаПроведен", Ссылка.Проведен);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Перем Заголовок, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаСостава;
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	
	Если Отказ Тогда Возврат КонецЕсли;
	
	мУчетнаяПолитика = УправлениеНастройками.ПолучитьУчетнуюПолитику();
	//флВыполнен = СостояниеЗаказаНаИзготовление = Перечисления.СостоянияЗаказаНаИзготовление.Выполнен;
	
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Укажем, что надо проверить:                         
	СтруктураОбязательныхПолей = Новый Структура("Клиент");           
	
	// Вызываем общую процедуру проверки.
	ПроведениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаСостава);
	
	// Проверить заполнение ТЧ .
	ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок);
	//
	ПроверитьЗаполнениеПередПроведением(Отказ, ТаблицаСостава);

	// Движения по документу
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаСостава, Отказ, Заголовок);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроверкаОбразованияОтрицательныхОстатков(Отказ);
	
	Если Не Отказ Тогда
		СостоянияЗаказов = РегистрыСведений.СостоянияЗаказовНаИзготовление.СоздатьНаборЗаписей();
		СостоянияЗаказов.Отбор.Документ.Установить(Ссылка);
		СостоянияЗаказов.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Префикс = Вид.ПрефиксНумерации;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнитьСоставПоВиду = Истина;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("Вид") Тогда 
			Вид = ДанныеЗаполнения.Вид;
			Прейскурант = Вид.Прейскурант;
			ДопустимыйДолг	 = Вид.ДопустимыйДолг;
			ПроцентАванса	 = Вид.ПроцентАванса;
			ИгнорироватьДолг = Вид.ИгнорироватьДолг;	
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("ДокументОснование") Тогда 
			ДокументОснование = ДанныеЗаполнения.ДокументОснование;
			Клиент = ДокументОснование.Клиент;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Прейскурант) Тогда
			Прейскурант = УправлениеНастройками.ПолучитьПрейскурантФилиала(РаботаСДокументамиСервер.ФилиалДокумента(ЭтотОбъект));
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("Прием") Тогда
			
			Клиент = ДанныеЗаполнения.Прием.Клиент;
			ДокументОснование = ДанныеЗаполнения.Прием;
			
			// Заполнение состава расчета планом лечения.
			Если ДанныеЗаполнения.Свойство("НаОстатокПланаЛечения") И ДанныеЗаполнения.НаОстатокПланаЛечения = Истина Тогда
				ПланЛечения = МедицинскаяДеятельность.ПланЛеченияСВыполнением(ДанныеЗаполнения.Прием.ПервичныйПрием, Ложь);
			Иначе
				ПланЛечения = ПланЛеченияПолныйДляОбработкаЗаполнения(ДокументОснование);
			КонецЕсли;
			
			Если ПланЛечения.Количество() <> 0 Тогда
			
				ЗаполнитьСоставПоВиду = Ложь;
				
				Для Каждого СтрокаОстатокПлана Из ПланЛечения Цикл
					Если СтрокаОстатокПлана.Остаток > 0
					   И ТипЗнч(СтрокаОстатокПлана.Номенклатура) = Тип("СправочникСсылка.Номенклатура")
					Тогда
						СтрокаСостава = Состав.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаСостава, СтрокаОстатокПлана);
						СтрокаСостава.Количество = СтрокаОстатокПлана.Остаток;
						СтрокаСостава.Примечание = СтрокаОстатокПлана.Комментарий;
					
						Если СтрокаСостава.Сумма <> 0
							И СтрокаСостава.Цена = 0
						Тогда
							Если СтрокаСостава.Количество = 0 Тогда
								СтрокаСостава.Сумма = 0;
							Иначе
								СтрокаСостава.Цена = СтрокаСостава.Сумма/СтрокаСостава.Количество;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
				Если ЗначениеЗаполнено(Прейскурант) Тогда
					
					ПроцентСкидкиВида = ?(ЗначениеЗаполнено(Вид), Вид.ПроцентСкидки,0);
					
					ТаблицаСостава = Состав.Выгрузить();
					Ценообразование.ПолучитьЦеныНоменклатуры(ТаблицаСостава, ТекущаяДата(), Прейскурант);
					Состав.Загрузить(ТаблицаСостава);
					Для Каждого СтрокаСостава Из Состав Цикл
						СтрокаСостава.ПроцентСкидки = ПроцентСкидкиВида;
						СтрокаСостава.ЦенаСоСкидкой = СтрокаСостава.Цена * (1 - ПроцентСкидкиВида/100);
						
						Если СтрокаСостава.Сумма = 0 Тогда
							СтрокаСостава.Сумма = СтрокаСостава.ЦенаСоСкидкой * СтрокаСостава.Количество;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;

	Если ЗначениеЗаполнено(Вид) Тогда
		ЗаполнитьСпецификацию();
		
		Если ЗаполнитьСоставПоВиду Тогда
			Документы.КомплексныйРасчетКлиента.ЗаполнитьСоставПоВиду(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПланЛеченияПолныйДляОбработкаЗаполнения(ДокументОснование)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПервичныйПрием", ДокументОснование.ПервичныйПрием);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПланыЛечения.Номенклатура КАК Номенклатура,
	|	СУММА(ПланыЛечения.Количество) КАК Остаток,
	|	//%Сумма%
	|	ПланыЛечения.Комментарий
	|ИЗ
	|	РегистрСведений.ПланыЛечения КАК ПланыЛечения
	|ГДЕ
	|	ПланыЛечения.Номенклатура ССЫЛКА Справочник.Номенклатура
	|	И ПланыЛечения.ПервичныйПрием = &ПервичныйПрием
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланыЛечения.Номенклатура,
	|	ПланыЛечения.Комментарий,
	|	ПланыЛечения.ПорядокЭлемента
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПланыЛечения.ПорядокЭлемента"
	;
	Если Метаданные.РегистрыСведений.ПланыЛечения.Ресурсы.Найти("Сумма") <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//%Сумма%", "СУММА(Сумма) КАК Сумма,");
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ЗаполнитьСпецификацию()
	УправлениеЗаказами.ЗаполнитьСпецификацииПоЗначениямЗаполнения(ЭтотОбъект);	
	УправлениеЗаказами.ЗаполнитьСпецификацииПоПараметрамHTML(ЭтотОбъект);
	УправлениеЗаказами.УпорядочитьПараметрыСпецификации(ЭтотОбъект);
КонецПроцедуры

Процедура ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаСостава, Отказ, Заголовок)
	
	Если Вид.Тип <> Перечисления.ТипыКомплексныхРасчетовКлиентов.ПредварительныйРасчет Тогда
		
		Справочники.КлючиСтрокКомплексныхРасчетов.ДобавитьКлючиПозицийРасчета(ТаблицаСостава);
		
		Для Каждого СтрокаСостава Из ТаблицаСостава Цикл
			Движение = Движения.НоменклатураКомплексныхРасчетовКлиентов.ДобавитьПриход();
			Движение.Период = НачалоДня(Дата);
			Движение.КомплексныйРасчет = Ссылка;
			Движение.КлючСтроки	= СтрокаСостава.КлючСтроки;
			Движение.Количество	= СтрокаСостава.Количество;
		КонецЦикла;
		Движения.НоменклатураКомплексныхРасчетовКлиентов.Записать();
		
		ПроверкаОбразованияОтрицательныхОстатков(Отказ);
		
	КонецЕсли;

КонецПроцедуры // ДвиженияПоРегистрам()

#КонецОбласти
